mahdi-benhassen/Esp32s3_sim4G_controller/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Production security and recovery defaults.
CONFIG_NVS_ENCRYPTION=y
# ESP32-S3 exposes HMAC key slots 0-5; slot 0 must be provisioned on production hardware.
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=0
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=n
CONFIG_ESP_SYSTEM_BROWNOUT_INTR=y

# Native esp_modem PPP is opt-in because it takes exclusive ownership of the SIM7600 UART.
CONFIG_B2_CELLULAR_PPP_ENABLED=n

# Optional network-parity adapters remain disabled until the carrier pinout is verified.
CONFIG_B2_ETHERNET_ENABLED=n
CONFIG_B2_I2C_EXPANDER_ENABLED=n

# BLE commissioning is disabled by default; enable only in a reviewed provisioning image.
CONFIG_B2_BLE_COMMISSIONING_ENABLED=n
